DB_NAME = 'quiz_bot.db'
quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },
    {
        'question': 'Какой метод отвечает за добавление элемента в конец списка?',
        'options': ['input()','append()','add()','include()'],
        'correct_option': 1
    },{
        'question': 'Каково основное назначение рекурсии в функциях?',
        'options': ['Bтерационный перебор через циклы', 'работа со списками','возвращение необходимого результата', 'замена цикла'],
        'correct_option': 3
    },{
        'question': 'Какая конструкция служит для создания анонимной функции?',
        'options': ['lambda func', 'anonymous', 'omega', 'lambda'],
        'correct_option': 3
    },{
        'question': 'Что такое рекурсия?',
        'options': ['описание какого-либо объекта внутри этого самого объекта', 'вызов функции в обратном порядке ее алгоритма', 'подбор параметров функции',
                    'возвращение результатов функции'],
        'correct_option': 0
    },{
        'question': 'За создание какой функции отвечает конструкция def?',
        'options': ['именной функции', 'рекурсивной функции', 'анонимной функции',' функции-итератора'],
        'correct_option': 0
    },{
        'question': 'Какая функция отвечает за вывод длины списка?',
        'options': ['len()', 'getLen()', 'size()', 'length()'],
        'correct_option': 1
    },{
        'question': 'Выберите верное утверждение про списки',
        'options': ['списки в Python являются изменяемыми', 'списки невозможно сортировать', 'списки имеют фиксированный размер',
                    'списки представляют собой массивы'],
        'correct_option': 1
    },{
        'question': 'Какие из функций являются уникальными?',
        'options': ['генераторы', 'итераторы', 'анонимные', 'именные'],
        'correct_option': 2
    }
]